[Killed] ConditionalExpression
src/gilded_rose.mjs:16:11
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
+      if (false) {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] ConditionalExpression
src/gilded_rose.mjs:16:48
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
+      if (this.items[i].name != "Aged Brie" && true) {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
killedBy: Gilded Rose Backstage passes with sellIn 1, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] ConditionalExpression
src/gilded_rose.mjs:17:13
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
       if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-        if (this.items[i].quality > 0) {
+        if (false) {
           if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
             this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] EqualityOperator
src/gilded_rose.mjs:17:13
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
       if (this.items[i].name != "Aged Brie" && this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-        if (this.items[i].quality > 0) {
+        if (this.items[i].quality <= 0) {
           if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
             this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:22:14
             this.items[i].quality = this.items[i].quality - 1;
           }
         }
-      } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
-        }
-      }
+      } else {}
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].sellIn = this.items[i].sellIn - 1;
killedBy: Gilded Rose Aged Brie with sellIn 0, quality 0
statusReason: expected [ Item{ name: 'Aged Brie', …(2) } ] to deeply equal [ Item{ name: 'Aged Brie', …(2) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:23:41
           }
         }
       } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
-        }
+        if (this.items[i].quality < 50) {}
       }
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
killedBy: Gilded Rose Aged Brie with sellIn 0, quality 0
statusReason: expected [ Item{ name: 'Aged Brie', …(2) } ] to deeply equal [ Item{ name: 'Aged Brie', …(2) } ]

[Killed] ConditionalExpression
src/gilded_rose.mjs:25:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
+          if (true) {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose Aged Brie with sellIn 0, quality 0
statusReason: expected [ Item{ name: 'Aged Brie', …(2) } ] to deeply equal [ Item{ name: 'Aged Brie', …(2) } ]

[Killed] ConditionalExpression
src/gilded_rose.mjs:26:17
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].sellIn < 11) {
+            if (true) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;
killedBy: Gilded Rose Backstage passes with sellIn 11, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:26:44
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
           if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
+            if (this.items[i].sellIn < 11) {}
             if (this.items[i].sellIn < 6) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose Backstage passes with sellIn 1, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] EqualityOperator
src/gilded_rose.mjs:27:19
           this.items[i].quality = this.items[i].quality + 1;
           if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
             if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
+              if (this.items[i].quality <= 50) {
                 this.items[i].quality = this.items[i].quality + 1;
               }
killedBy: Gilded Rose Backstage passes with sellIn 1, quality 49
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] EqualityOperator
src/gilded_rose.mjs:31:17
                 this.items[i].quality = this.items[i].quality + 1;
               }
             }
-            if (this.items[i].sellIn < 6) {
+            if (this.items[i].sellIn <= 6) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;
killedBy: Gilded Rose Backstage passes with sellIn 6, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] EqualityOperator
src/gilded_rose.mjs:31:17
                 this.items[i].quality = this.items[i].quality + 1;
               }
             }
-            if (this.items[i].sellIn < 6) {
+            if (this.items[i].sellIn >= 6) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1;
killedBy: Gilded Rose Backstage passes with sellIn 1, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:39:63
           }
         }
       }
-      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-        this.items[i].sellIn = this.items[i].sellIn - 1;
-      }
+      if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {}
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:42:37
       if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
-      if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != "Aged Brie") {
-          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality;
-          }
-        } else {
-          if (this.items[i].quality < 50) {
-            this.items[i].quality = this.items[i].quality + 1;
-          }
-        }
-      }
+      if (this.items[i].sellIn < 0) {}
     }
 
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:43:48
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != "Aged Brie") {
-          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality;
-          }
-        } else {
+        if (this.items[i].name != "Aged Brie") {} else {
           if (this.items[i].quality < 50) {
             this.items[i].quality = this.items[i].quality + 1;
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] EqualityOperator
src/gilded_rose.mjs:44:15
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
-          if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
+          if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert") {
             if (this.items[i].quality > 0) {
               if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:45:44
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
           if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
-                this.items[i].quality = this.items[i].quality - 1;
-              }
-            }
+            if (this.items[i].quality > 0) {}
           } else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality;
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] EqualityOperator
src/gilded_rose.mjs:45:17
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != "Aged Brie") {
           if (this.items[i].name != "Backstage passes to a TAFKAL80ETC concert") {
-            if (this.items[i].quality > 0) {
+            if (this.items[i].quality <= 0) {
               if (this.items[i].name != "Sulfuras, Hand of Ragnaros") {
                 this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose foo with sellIn 0, quality 3
statusReason: expected [ Item{ name: 'foo', …(2) } ] to deeply equal [ Item{ name: 'foo', …(2) } ]

[Killed] BlockStatement
src/gilded_rose.mjs:50:18
                 this.items[i].quality = this.items[i].quality - 1;
               }
             }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality;
-          }
+          } else {}
         } else {
           if (this.items[i].quality < 50) {
killedBy: Gilded Rose Backstage passes with sellIn 0, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]

[Killed] ArithmeticOperator
src/gilded_rose.mjs:51:37
               }
             }
           } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality;
+            this.items[i].quality = this.items[i].quality + this.items[i].quality;
           }
         } else {
killedBy: Gilded Rose Backstage passes with sellIn 0, quality 0
statusReason: expected [ Item{ …(3) } ] to deeply equal [ Item{ …(3) } ]
